---
type: ElementIdSetFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementIdSetFilter

`Autodesk.Revit.DB.ElementIdSetFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementIdSetFilter | 2021 | `public ElementIdSetFilter ( ICollection < ElementId > idsToInclude )` |
| Method | GetIdsToInclude | 2021 | `public ICollection < ElementId > GetIdsToInclude ()` |
| Method | PassesFilter | — | `` |